<details><summary>This apply is out of date. A new apply has been performed.</summary>

> 
>   **Terraform apply** (Okta preview) ran in [7 seconds](https://github.com/evanyeung-clear/terraform-ci/actions/runs/20276039026).
>   ```
>   terraform apply -no-color -input=false -auto-approve -target=okta_user.test4
>   ```
> 
>   <details>
>   <summary>Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
> </summary>
> 
>   ```
>   [INFO] Starting Terraform preprocessing in terraform environment...
> [INFO] Cleaning up existing temporary files...
> [INFO] Consolidating .tf files from subdirectories into _consolidated.tf...
> [INFO] Consolidated 0 files into _consolidated.tf
> [INFO] Running terraform with arguments: apply -no-color -input=false -auto-approve -target=okta_user.test4
> [INFO] Using terraform executable: /usr/local/bin/terraform
> 
> Terraform used the selected providers to generate the following execution
> plan. Resource actions are indicated with the following symbols:
>   + create
> 
> Terraform will perform the following actions:
> 
>   # okta_user.test4 will be created
>   + resource "okta_user" "test4" {
>       + custom_profile_attributes = (known after apply)
>       + email                     = "example4@example.com"
>       + expire_password_on_create = false
>       + first_name                = "John"
>       + id                        = (known after apply)
>       + last_name                 = "Smith"
>       + login                     = "example4@example.com"
>       + raw_status                = (known after apply)
>       + skip_roles                = false
>       + status                    = "ACTIVE"
>     }
> 
> Plan: 1 to add, 0 to change, 0 to destroy.
> okta_user.test4: Creating...
> okta_user.test4: Creation complete after 2s [id=00uyehrgwiY9jwYd0697]
> 
> Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
> [INFO] Cleaning up temporary file...
> 
>   ```
>   </details>
> 
>   ---
>   > 📌 Reminder to validate the configuration was applied correctly, then **merge this PR** to release the deployment lock.
>   
</details>